clear
clc
pi=3.14;
syms s1 c1 s2 c2 s3 c3 s4 c4 s5 c5 s6 c6
a1 = pi/2;a2 = -pi/2;a3 = 0;a4 = 0;a5 = -pi/2;a6 = 0;
%s1 = sin(a1);s2 = sin(a2);s3 = sin(a3);s4 = sin(a4);s5 = sin(a5);s6 = sin(a6);
%c1 = cos(a1);c2 = cos(a2);c3 = cos(a3);c4 = cos(a4);c5 = cos(a5);c6 = cos(a6);


T01 = [c1 0 s1 0;s1 0 -c1 0;0 1 0 264; 0 0 0 1];
T12 = [-s2 -c2 0 -225*s2;c2 -s2 0 225*c2;0 0 1 0; 0 0 0 1];
Th12 = [-s2 -c2 0 -112.5*s2;c2 -s2 0 112.5*c2;0 0 1 0; 0 0 0 1];
T23 = [c3 0 s3 0; s3 0 -c3 0; 0 1 0 0; 0 0 0 1];

T34 = [c4 0 s4 0;s4 0 -c4 0;0 1 0 217.3;0 0 0 1];
T45 = [-s5 0 c5 0;c5 0 s5 0; 0 1 0 0;0 0 0 1];
T56 = [c6 -s6 0 0;s6 c6 0 0;0 0 1 -40; 0 0 0 1];

T06 = T01*T12*T23*T34*T45*T56;

pos_arm = T01*Th12;
arm_x = -(112.5*c1*s2);
arm_y = -(112.5*s1*s2);
arm_z = (112.5*c2) + 264;

% 旋转应该使用变换之前的再乘上本级的变换方程
% 或许可以通过调整起始的角度偏置来处理
arm_rotate = [c2,0,s2,0;0,1,0,0;-s2,0,c2,0;0,0,0,1]*T01 
arm_ry = 0;
arm_rx = 0;